Exercise: Create a dataframe of at least 1000 rows about an hypothetical list of employees of your company, extract all employees in the IT department and a Salary greater than 55000.

Exercise: Create a column to split the data in Low, Medium, High fare prices and calculate the average Age per each section. Fill the Age set to nan and calculate the average age again, how did it change? How can you fill the age so that the average does not change?

In [12]:
import random
import string

#hypothetical list of employees of your company
names_list = []
for el in range(1000):
    name = ''.join(random.choice(string.ascii_lowercase) for _ in range(5))
    surname = ''.join(random.choice(string.ascii_lowercase) for _ in range(5))
    names_list.append(name.capitalize() +' ' + surname.capitalize())

In [20]:
#Create a dataframe 
import pandas as pd

df = pd.DataFrame({"Employees": names_list})

#add the departments and Salary columns:
departments_list = []
salary_list = []
for idx in range(1000):
    departments_list.append(''.join(random.choice(string.ascii_uppercase) for _ in range(2)))
    salary_list.append(random.randint(20000,80000))
                            
df = pd.DataFrame({"Employees": names_list, "Departments": departments_list, "Salary": salary_list})
#extract all employees in the IT department and a Salary greater than 55000.
condition = (df['Departments'] == 'IT') & (df['Salary'] > 55000)
df[condition]

       Employees Departments  Salary
463  Drhcu Jwxsd          IT   57245

In [86]:
fare_list = []
ages = []
for idx in range(1000):
    if idx < random.randint(0,400):
        fare_list.append('Low')
        ages.append(random.randint(18,38))
    elif idx < random.randint(500,800):
        fare_list.append('Medium')
        ages.append(random.randint(48,68))
    else:
        fare_list.append('High')
        ages.append(float('nan'))
        
        
df['fare prices'] = fare_list
df['Age'] = ages


# Group by age bins
# Create age bins
#bins = [18, 30, 45, 67]
#labels = ['High', 'Low', 'Medium']
#df['fare prices'] = pd.cut(df['Age'], bins=bins, labels=labels, right=False)

In [87]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Employees    1000 non-null   object
 1   Departments  1000 non-null   object
 2   Salary       1000 non-null   int64
 3   fare prices  1000 non-null   object
 4   Age          645 non-null    float64
dtypes: float64(1), int64(1), object(3)
memory usage: 39.2+ KB

In [88]:
# calculate the average Age per each section
df.groupby('fare prices')['Age'].mean()

fare prices
High            NaN
Low       28.512953
Medium    58.150442
Name: Age, dtype: float64

In [89]:
#Fill the Age set to nan and calculate the average age again, how did it change? 
df['Age'] = df['Age'].fillna(df['Age'].mean())
df.info()
df.groupby('fare prices')['Age'].mean()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Employees    1000 non-null   object
 1   Departments  1000 non-null   object
 2   Salary       1000 non-null   int64
 3   fare prices  1000 non-null   object
 4   Age          1000 non-null   float64
dtypes: float64(1), int64(1), object(3)
memory usage: 39.2+ KB

fare prices
High      49.282171
Low       28.512953
Medium    58.150442
Name: Age, dtype: float64

I filled the nan values replacing it with the mean value of the column, in order to not modify the mean value of the whole column.
The values in which nan values are not present, don't change after the fillna() procedure.